In [1]:
import sqlite3
###Connecting to a SQLite database

connection=sqlite3.connect('example.db')
connection

In [3]:
curssor=connection.cursor()

#Creating a table
curssor.execute('''
Create Table If Not Exists employee(
                id Integer Primary Key,
                name Text Not Null,
                age Integer,
                department text
                )   
  ''')

#Commiting changes
connection.commit()

In [7]:
curssor.execute('''
Select * from employee
                   
  ''')

#Inserting data in sqlite3
curssor.execute('''
Insert into employee(name,age,department)
                values('Sidd',20,'Data Scientist fff')
                
                ''')

curssor.execute('''
Insert into employee(name,age,department)
                values('wdwe',20,'crfc fqc fff')
                
                ''')

curssor.execute('''
Insert into employee(name,age,department)
                values('jutjntn',20,'btjbeavgWE')
                
                ''')

connection.commit()

In [11]:
#Quering the data from table

curssor.execute('Select * from employee')
rows=curssor.fetchall()

for row in rows:
    print(row)

(1, 'Sidd', 29, 'Data Scientist fff')
(2, 'wdwe', 20, 'crfc fqc fff')
(3, 'jutjntn', 20, 'btjbeavgWE')
(4, 'Sidd', 29, 'Data Scientist fff')
(5, 'wdwe', 20, 'crfc fqc fff')
(6, 'jutjntn', 20, 'btjbeavgWE')

In [12]:
#Updating data
curssor.execute('''
UPDATE employee
Set age=29
where name='Sidd'
''' )
connection.commit()

curssor.execute('Select * from employee')
rows=curssor.fetchall()

for row in rows:
    print(row)

(1, 'Sidd', 29, 'Data Scientist fff')
(2, 'wdwe', 20, 'crfc fqc fff')
(3, 'jutjntn', 20, 'btjbeavgWE')
(4, 'Sidd', 29, 'Data Scientist fff')
(5, 'wdwe', 20, 'crfc fqc fff')
(6, 'jutjntn', 20, 'btjbeavgWE')

In [14]:
curssor.execute('''
Delete from employee
                where name='Sidd'

''')
connection.commit()

curssor.execute('Select * from employee')
rows=curssor.fetchall()

for row in rows:
    print(row)

(2, 'wdwe', 20, 'crfc fqc fff')
(3, 'jutjntn', 20, 'btjbeavgWE')
(5, 'wdwe', 20, 'crfc fqc fff')
(6, 'jutjntn', 20, 'btjbeavgWE')

In [ ]:
import sqlite3

# Connect to (or create) the database
connectionn = sqlite3.connect('sales_data.db')
cursor = connectionn.cursor()

# Create the sales table
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT,
)
''')

# Sample sales data
sales_data = [
    ('2023-01-01', 'Product A', 100, 'North'),
    ('2023-01-02', 'Product B', 150, 'South'),
    ('2023-01-03', 'Product C', 200, 'East'),
    ('2023-01-04', 'Product A', 130, 'West'),
    ('2023-01-05', 'Product B', 160, 'North'),
    ('2023-01-06', 'Product C', 190, 'South'),
    ('2023-01-07', 'Product A', 120, 'East'),
    ('2023-01-08', 'Product B', 170, 'West'),
    ('2023-01-09', 'Product C', 210, 'North'),
    ('2023-01-10', 'Product A', 140, 'South'),
    ('2023-01-11', 'Product B', 180, 'East'),
    ('2023-01-12', 'Product C', 220, 'West'),
    ('2023-01-13', 'Product A', 115, 'North'),
    ('2023-01-14', 'Product B', 165, 'South'),
    ('2023-01-15', 'Product C', 205, 'East'),
    ('2023-01-16', 'Product A', 135, 'West'),
    ('2023-01-17', 'Product B', 175, 'North'),
    ('2023-01-18', 'Product C', 215, 'South'),
    ('2023-01-19', 'Product A', 125, 'East'),
    ('2023-01-20', 'Product B', 185, 'West'),
]

# Insert data into the table
cursor.executemany('''
INSERT INTO sales (date, product, sales, region)
VALUES (?, ?, ?, ?)
''', sales_data)

# Save and close
connectionn.commit()
# connectionn.close()

OperationalError: table sales has no column named region